app/controllers/notes_controller.rb

SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "notes" SET "published" = ?, "updated_at" = ? WHERE "notes"."id" = 5  [["published", "t"], ["updated_at", "2017-09-18 04:59:51.400927"]]
---
	def publish
		@note = Note.find(params[:id])
		@note.update(published: true)

SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "notes" SET "published" = ?, "updated_at" = ? WHERE "notes"."id" = 11  [["published", "f"], ["updated_at", "2017-09-17 12:36:00.877826"]]
---
	def unpublish
		@note = Note.find(params[:id])
		@note.update(published: false)

INSERT INTO "notes" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
	def create
		@note = current_user.notes.build(note_params)

		if @note.save

UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = 1  [["title", "Smart sharing and caring"], ["updated_at", "2017-09-16 17:34:37.328972"]]
---
	def update
		if @note.update(note_params)

SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = ? LIMIT 1  [["id", 4]]
---
	def find_note
		@note = Note.find(params[:id])